## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aca.azurerm_container_app.container_app will be created
  + resource "azurerm_container_app" "container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "example-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-terraform-gh-actions-01"
      + revision_mode                 = "Single"

      + template {
          + max_replicas                     = 10
          + min_replicas                     = 0
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "0.5Gi"
              + name              = "examplecontainerapp"
            }
        }
    }

  # module.aca.azurerm_container_app_environment.environment will be created
  + resource "azurerm_container_app_environment" "environment" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus2"
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "gmezanappcontainerzzz"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-terraform-gh-actions-01"
      + static_ip_address                = (known after apply)
      + zone_redundancy_enabled          = false
    }

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus2"
      + login_server                  = (known after apply)
      + name                          = "gmezanregistry001"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-terraform-gh-actions-01"
      + sku                           = "Basic"
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.rg1.azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "rg-terraform-gh-actions-01"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>